SM_для_EDT/src/InformationRegisters/vftНормыСледования/vftНормыСледования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>vftНормыСледования</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Время</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Расстояние</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяВБалласте</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.vftПроектыСудов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Судно</name>
    <type>
      <types>CatalogRef.vftСуда</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пункт1</name>
    <type>
      <types>CatalogRef.vftПунктыСледования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пункт2</name>
    <type>
      <types>CatalogRef.vftПунктыСледования</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SM_для_EDT/src/InformationRegisters/vftНормыСледования/ManagerModule.bsl
&НаСервере
Функция ПолучитьНормыСледования(ТекущийПункт, ПредыдущийПункт, ПроектСудна, ГрузБалласт, ОсновноеСудно) Экспорт
	
	//raruskzn AydaFZ 15.11.2019{
	//Добавил параметр ОсновноеСудно 
	//raruskzn AydaFZ 15.11.2019 }
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийПункт",ТекущийПункт);
	Запрос.УстановитьПараметр("ПредыдущийПункт",ПредыдущийПункт);
	Запрос.УстановитьПараметр("ПроектСудна",ПроектСудна);
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	//raruskzn AydaFZ 15.11.2019{
	Запрос.УстановитьПараметр("ОсновноеСудно", ОсновноеСудно);

	Запрос.Текст = "ВЫБРАТЬ
	               |	vftНормыСледованияСрезПоследних.Время КАК Время,
	               |	vftНормыСледованияСрезПоследних.ВремяВБалласте КАК ВремяВБалласте,
	               |	vftНормыСледованияСрезПоследних.Расстояние КАК Расстояние
	               |ИЗ
	               |	РегистрСведений.vftНормыСледования.СрезПоследних(
	               |			&Дата,
	               |			Проект = &ПроектСудна
	               |				И Пункт1 = &ПредыдущийПункт
	               |				И Пункт2 = &ТекущийПункт
	               |				И Судно = &ОсновноеСудно) КАК vftНормыСледованияСрезПоследних";
	//raruskzn AydaFZ 15.11.2019}
	Результат = Запрос.Выполнить().Выгрузить();
	СтруктураВозврата = Новый Структура;
	Если ГрузБалласт Тогда
		СтруктураВозврата.Вставить("Время", ?(Результат.Количество()=0,0,Результат[0].Время*60));
	Иначе
		СтруктураВозврата.Вставить("Время", ?(Результат.Количество()=0,0,Результат[0].ВремяВБалласте*60));
	КонецЕсли; 
	
	СтруктураВозврата.Вставить("Расстояние", ?(Результат.Количество()=0,0,Результат[0].Расстояние));
	
	Возврат СтруктураВозврата;
КонецФункции
